In [3]:
import pandas as pd

In [4]:
pip install lxml

Requirement already satisfied: lxml in c:\users\user\anaconda3\lib\site-packages (4.8.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
url = 'https://en.wikipedia.org/wiki/World_population'

In [6]:
tables = pd.read_html(url)

If this doesn't work, check that the site is not blocked by your company's firewall

right click + View page source AKA Ctrl + U is another workaround

In [7]:
len(tables)

25

There's 25 tables within the Wikipedia article

In [8]:
tables[0]

  World population milestones in billions[62] (Worldometers estimates)        \
                                                            Population     1
0                                               Year                    1804
1                                      Years elapsed                       —


      2     3     4     5     6     7     8     9    10
0  1930  1960  1974  1987  1998  2010  2022  2037  2057
1   126    30    14    13    11    12    12    15    20

In [9]:
tables[1]

,0,1
0,.mw-parser-output .legend{page-break-inside:av...,67.5–70 65–67.5 60–65 55–60 50–55

Not all of the tables actually make sense. Some of them are simply used to format the article and don't contain any useful data, as shown above

In [11]:
tables[2].head()

   # Most populous countries  2000  2015 2030[A]
0  1                China[B]  1270  1376    1416
1  2                   India  1053  1311    1528
2  3           United States   283   322     356
3  4               Indonesia   212   258     295
4  5                Pakistan   136   208     245

In [13]:
tables[0].columns

MultiIndex([('World population milestones in billions[62] (Worldometers estimates)', ...),
            ('World population milestones in billions[62] (Worldometers estimates)', ...),
            ('World population milestones in billions[62] (Worldometers estimates)', ...),
            ('World population milestones in billions[62] (Worldometers estimates)', ...),
            ('World population milestones in billions[62] (Worldometers estimates)', ...),
            ('World population milestones in billions[62] (Worldometers estimates)', ...),
            ('World population milestones in billions[62] (Worldometers estimates)', ...),
            ('World population milestones in billions[62] (Worldometers estimates)', ...),
            ('World population milestones in billions[62] (Worldometers estimates)', ...),
            ('World population milestones in billions[62] (Worldometers estimates)', ...),
            ('World population milestones in billions[62] (Worldometers estimates)', ...)],
           )

In [14]:
tables[0]

  World population milestones in billions[62] (Worldometers estimates)        \
                                                            Population     1
0                                               Year                    1804
1                                      Years elapsed                       —


      2     3     4     5     6     7     8     9    10
0  1930  1960  1974  1987  1998  2010  2022  2037  2057
1   126    30    14    13    11    12    12    15    20

Table 0 has a multi-index where the first index is the 
	World population milestones in billions header. This isn't actually a useful index, it's just the title, but it's treated as an index

The second set of columns, Population 	1 	2 	3 	4 	5 	6 etc. is much more useful

In [30]:
milestones = tables[0]

In [31]:
milestones = milestones['World population milestones in billions[62] (Worldometers estimates)']

By calling the outer index, it is stripped away and the inner index is shown.

In [32]:
milestones

      Population     1     2     3     4     5     6     7     8     9    10
0           Year  1804  1930  1960  1974  1987  1998  2010  2022  2037  2057
1  Years elapsed     —   126    30    14    13    11    12    12    15    20

In [39]:
top10 = tables[2]
top10.head()

   # Most populous countries  2000  2015 2030[A]
0  1                China[B]  1270  1376    1416
1  2                   India  1053  1311    1528
2  3           United States   283   322     356
3  4               Indonesia   212   258     295
4  5                Pakistan   136   208     245

In [40]:
top10 = top10.drop('#',axis = 1)

In [41]:
top10.head()

  Most populous countries  2000  2015 2030[A]
0                China[B]  1270  1376    1416
1                   India  1053  1311    1528
2           United States   283   322     356
3               Indonesia   212   258     295
4                Pakistan   136   208     245

In [50]:
top10.columns = ['Country', '2000', '2015', '2030 Est.']
top10 = top10.drop(11, axis = 0)

In [44]:
top10.head()

         Country  2000  2015 2030 Est.
0       China[B]  1270  1376      1416
1          India  1053  1311      1528
2  United States   283   322       356
3      Indonesia   212   258       295
4       Pakistan   136   208       245

In [51]:
top10.to_html('sample_table.html', index = False)

          Country  2000  2015 2030 Est.
0        China[B]  1270  1376      1416
1           India  1053  1311      1528
2   United States   283   322       356
3       Indonesia   212   258       295
4        Pakistan   136   208       245
5          Brazil   176   206       228
6         Nigeria   123   182       263
7      Bangladesh   131   161       186
8          Russia   146   146       149
9          Mexico   103   127       148
10    World total  6127  7349      8501